Started on [2021-07-03 Sat] 

I need three functions and some syntax I don't know yet, let's do some file IO

* Starting
 #+name:c-test
#+begin_src C :results output
printf ("Hello World!!\n");
#+end_src 

#+RESULTS:
: Hello World!!

#+name:basic-io
#+begin_src C :results output
#include <stdio.h>
#include <stdlib.h>



int main()
{
   char ch, file_name[25];
   FILE *fp;

   FileIn = fopen("FoxDog.txt", "r");

   if (FileIn == NULL)
   {
      perror("Error while opening the file.\n");
      exit(EXIT_FAILURE);
   }

   printf("The contents of %s file are:\n", file_name);

   while((ch = fgetc(FileIn)) != EOF)
      printf("%c", ch);

   fclose(FileIn);
   return 0;
}
#+end_src 

#+RESULTS: basic-io
: The contents of  file are:
: The quick fox jumps over the lazy brown dog


Oh... it's just one line. Okay. Well that simplifies things a bit. I just need a single vector that has the string split by white space.

https://overiq.com/c-programming-101/array-of-strings-in-c/

Oh joy, it appears to make a vector, I need to define the maximum length first. That means I either hard code the length and manually think of how long it need to be, or I need a function that can look at the file and determine the maximum length I am going to need to before I initialize the vector. 

I can imagine a for loop going through all the white space delineated words and simply updating a function local variable with the highest number. But feels like if I am going to find all these words once, I might as well be adding them to a vector. 

#+begin_quote
 1  char ch_arr[3][10] = {  
 2                           {'s', 'p', 'i', 'k', 'e', '\0'},  
 3                           {'t', 'o', 'm','\0'},  
 4                           {'j', 'e', 'r', 'r', 'y','\0'}  
 5                       };  

It is important to end each 1-D thing by the null character, otherwise, it will be just an thing of characters.
We can't use them as strings. 

Declaring an thing of strings this way is rather tedious, that's why C provides an alternative syntax to
achieve the same thing. This above initialization is equivalent to:

 1  char ch_arr[3][10] = {  
 2                           "spike",  
 3                           "tom",  
 4                           "jerry"  
 5                       };  
#+end_quote


https://www.programiz.com/c-programming/c-arrays
Not quite what I was looking for but some of the syntax I  need is here

...you know what, I will make that a question to ask later. Let's just eye ball it for now.




#+name:vector-test
#+begin_src C :results output
char ch_arr[3][5] = {
  {'B', 'o', 'b','\0'},
  {'A', 'n', 'n','\0'},
  {'B', 'e', 'n','\0'},
 }; 
for (int i = 0; i < 3; i += 1){
  printf (ch_arr[i]);
  printf (" ");
  }; 
#+end_src 

#+RESULTS: vector-test
: Bob Ann Ben 

It's kind of hacky to get the spaces in there, but it works. Anyway, that is how I will be getting the words FileOut of a vector to write into a file.

Look like 
** How about just reading words?
  [2021-08-07 Sat] 
  It's onto week two and I think I need to break the problem down a little more. One of the homework requirements is to read in one word at a time. I realized I don't know how to do that. Let's figure it out.

 
#+name:readWords
#+begin_src C :results output
#include <stdio.h>
#include <stdlib.h>

int main()
{
   char ch;
   FILE *fp;

   fp = fopen("FoxDog.txt", "r");

   if (fp == NULL)
   {
      perror("Error while opening the file.\n");
      exit(EXIT_FAILURE);
   }

   printf("The contents of the file are:\n");

   while((ch = fgetc(fp)) != EOF)
      printf("%c", ch);

   fclose(fp);
   return 0;
}
#+end_src

#+RESULTS: readWords
: The contents of the file are:
: The quick fox jumps over the lazy brown dog

okay, so this is a way to get characters out of the file one by one. Ideally, I read in characters into a small buffer one at a time, then write them to the file when I know the word is done.

...but getting characters one at a time sounds like a great way to have data and no where to put it. Don't I need a memory buffer to put something before I go grabbing it from the file?

Let's use this and make it read just one word. How do I get it to stop what what is either the end of a word or the end of the file?


#+name:readOneWord
#+begin_src C :results output
#include <stdio.h>
#include <stdlib.h>

int main()
{
   char ch;
   FILE *fp;
   char* word;

   fp = fopen("FoxDog.txt", "r");

   if (fp == NULL)
   {
      perror("Error while opening the file.\n");
      exit(EXIT_FAILURE);
   }

   printf("One word in the file is:\n");
   
   for(int i = 0; i < 4;){
     ch = fgetc(fp);
     printf("%c", ch);
     i++;
  }
   
   fclose(fp);
   return 0;
}
#+end_src

#+RESULTS: readOneWord
: One word in the file is:
: The 

Interesting, I can't tell it to read from another part of the file by just moving "i" because the call to fgetc is not using i to determine where it reads from. hmn. what is Fgetc anyway?

Hmn... I was thinking maybe I could try to read in words at a time by telling a char pointer that the start of the file was a string, but it looks like I can't treat a file pointer like its a string.

** Let's try a function that just prints the word?

   
#+name:printOneWord
#+begin_src C :results output
#include <stdio.h>
#include <stdlib.h>

void print_next_word(FILE *filePointer, FILE *outPointer){
  char word[10];
  char stopper = 'a';
  int i = 0;
  int length = 0;
  while(stopper != ' ')
    {
      word[i] = fgetc(filePointer);
      stopper = word[i];
      if( feof(filePointer) ) {
        word[i] = ' ';
        i++;
        break;
      }
      i++;
    }
  length = i;
  int j = 0;
  i = i - 1;
  for(j = 0; j < length;)
    {
      fprintf(outPointer,"%c",word[i]);
      j++;
      i = i-1;
      }
}
  
int main( int argc, char *argv[] )
{
  
   char ch;
   FILE *fp;

   fp = fopen(argv[0], "r");
   out = fopen(argv[1],"w"); 
   

   if (fp == NULL)
   {
      perror("Error while opening the file.\n");
      exit(EXIT_FAILURE);
   }

   int breakme = 0;
   while(breakme == 0)
     {
      print_next_word(fp, out);
      if(feof(fp))
        {
        breakme = 1;
        break;
        }
     }
   
   fclose(fp); 
   fclose(out);
   return 0;
}
#+end_src

#+RESULTS: printOneWord
: ehT kciuq xof spmuj revo eht yzal nworb god

Okay, I just need to wire up the out file, and I thin this is done. 
